InformationRegisters/РегистрацииУведомленийОПрекращенииОтпускаПоУходуЗаРебенком.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>РегистрацииУведомленийОПрекращенииОтпускаПоУходуЗаРебенком</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Страхователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияДокументаСЭДОФСС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоставкаУспех</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоставкаДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РегистрацияУспех</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РегистрацияДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РегистрацияИдентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РегистрацияСтатус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕстьОшибкиФЛК</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсходящийДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УведомлениеОПрекращенииОтпускаПоУходуЗаРебенком</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсходящийНомерСтроки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДоставкаТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрацияТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстОшибкиФЛК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстОшибкиСтроки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСтроки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/РегистрацииУведомленийОПрекращенииОтпускаПоУходуЗаРебенком/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Запись.ИсходящийДокумент) Тогда
		ТолькоПросмотр = Истина;
	Иначе
		Элементы.ПоясняющаяНадписьВШапке.Видимость = Ложь;
		Элементы.ИсходныйДокументГруппа.Поведение = ПоведениеОбычнойГруппы.Обычное;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Запись.РегистрацияСтатус)
		И Элементы.РегистрацияСтатус.СписокВыбора.НайтиПоЗначению(Запись.РегистрацияСтатус) = Неопределено Тогда
		Представление = СтрШаблон(НСтр("ru = 'Неизвестный статус регистрации: %1'"), Запись.РегистрацияСтатус);
		Элементы.РегистрацияСтатус.СписокВыбора.Добавить(Запись.РегистрацияСтатус, Представление);
	КонецЕсли;
	
	ЭлементУО = ОбщегоНазначенияБЗК.ДобавитьУсловноеОформление(ЭтотОбъект, "ОшибкиПоСтрокамЗаявление");
	ОбщегоНазначенияБЗК.УстановитьПараметрУсловногоОформления(ЭлементУО, "Видимость", Ложь);
	ОбщегоНазначенияБЗК.УстановитьПараметрУсловногоОформления(ЭлементУО, "Отображать", Ложь);
	ОбщегоНазначенияБЗК.ДобавитьОтборУсловногоОформления(ЭлементУО, "Заявление", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	
	ЭлементУО = ОбщегоНазначенияБЗК.ДобавитьУсловноеОформление(ЭтотОбъект, "ОшибкиПоСтрокамОтветНаЗапрос");
	ОбщегоНазначенияБЗК.УстановитьПараметрУсловногоОформления(ЭлементУО, "Видимость", Ложь);
	ОбщегоНазначенияБЗК.УстановитьПараметрУсловногоОформления(ЭлементУО, "Отображать", Ложь);
	ОбщегоНазначенияБЗК.ДобавитьОтборУсловногоОформления(ЭлементУО, "Заявление", ВидСравненияКомпоновкиДанных.Заполнено);
	ОбщегоНазначенияБЗК.ДобавитьОтборУсловногоОформления(ЭлементУО, "ОтветНаЗапрос", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ЗаполнитьСписокВыбораСтатусов();
	
	ЗаполнитьОшибкиПоСтрокам();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_ОтветНаЗапросФССДляРасчетаПособия"
		И (Источник = Запись.ИсходящийДокумент Или Не ЗначениеЗаполнено(Источник)) Тогда
		ПодключитьОбработчикОжиданияПрочитать();
		
	ИначеЕсли ИмяСобытия = СЭДОФССКлиент.ИмяСобытияПослеПолученияСообщенийОтФСС()
		Или ИмяСобытия = СЭДОФССКлиент.ИмяСобытияПослеОтправкиПодтвержденияПолучения() Тогда
		ПодключитьОбработчикОжиданияПрочитать();
		
	ИначеЕсли ИмяСобытия = "Запись_РегистрацииОтветовНаЗапросыФССДляРасчетаПособий"
		И (Источник = Запись.ИсходящийДокумент Или Не ЗначениеЗаполнено(Источник)) Тогда
		ПодключитьОбработчикОжиданияПрочитать();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("Запись_РегистрацииОтветовНаЗапросыФССДляРасчетаПособий", Запись.ИсходящийДокумент, Запись.ИсходящийДокумент);
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПоясняющаяНадписьВШапкеОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Документ.УведомлениеОПрекращенииОтпускаПоУходуЗаРебенком.ФормаОбъекта", Новый Структура("Ключ", Запись.ИсходящийДокумент));
КонецПроцедуры

&НаКлиенте
Процедура ВключитьВозможностьРедактирования(Команда)
	ТолькоПросмотр = Ложь;
	ОбновитьЭлементыФормы();
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыОшибкиПоСтрокам

&НаКлиенте
Процедура ОшибкиПоСтрокамВыбор(ТаблицаФормы, ИдентификаторСтроки, Колонка, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СтрокаТаблицы = ТаблицаФормы.ДанныеСтроки(ИдентификаторСтроки);
	Если СтрокаТаблицы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если Колонка = Элементы.ОшибкиПоСтрокамРебенок Тогда
		Если ЗначениеЗаполнено(СтрокаТаблицы.Ребенок) Тогда
			ПоказатьЗначение(, СтрокаТаблицы.Ребенок);
		КонецЕсли;
	ИначеЕсли Колонка = Элементы.ОшибкиПоСтрокамТекстОшибкиСтроки Тогда
		Если ЗначениеЗаполнено(СтрокаТаблицы.ТекстОшибкиСтроки) Тогда
			ИнформированиеПользователяКлиент.ПоказатьПодробности(СтрокаТаблицы.ТекстОшибкиСтроки);
		КонецЕсли;
	ИначеЕсли Колонка = Элементы.ОшибкиПоСтрокамЗаявление Тогда
		Если ЗначениеЗаполнено(СтрокаТаблицы.Заявление) Тогда
			ПоказатьЗначение(, СтрокаТаблицы.Заявление);
		КонецЕсли;
	ИначеЕсли Колонка = Элементы.ОшибкиПоСтрокамОтветНаЗапрос Тогда
		Если ЗначениеЗаполнено(СтрокаТаблицы.ОтветНаЗапрос) Тогда
			ПоказатьЗначение(, СтрокаТаблицы.ОтветНаЗапрос);
		КонецЕсли;
	ИначеЕсли Колонка = Элементы.ОшибкиПоСтрокамИдентификаторСтроки Тогда
		Если ЗначениеЗаполнено(СтрокаТаблицы.ИдентификаторСтроки) Тогда
			Измерения = Новый Структура;
			Измерения.Вставить("ИдентификаторСообщения", Запись.ИдентификаторСообщения);
			Измерения.Вставить("ИдентификаторСтроки",    СтрокаТаблицы.ИдентификаторСтроки);
			ПараметрыЗаписи = Новый Массив(1);
			ПараметрыЗаписи[0] = Измерения;
			КлючРегистра = Новый(Тип("РегистрСведенийКлючЗаписи.РегистрацииУведомленийОПрекращенииОтпускаПоУходуЗаРебенком"), ПараметрыЗаписи);
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Ключ", КлючРегистра);
			ОткрытьФорму(
				"РегистрСведений.РегистрацииУведомленийОПрекращенииОтпускаПоУходуЗаРебенком.ФормаЗаписи",
				ПараметрыФормы,
				,
				,
				,
				,
				,
				РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДоставкаИдентификаторТекстXML(Команда)
	СЭДОФССКлиент.ПоказатьТекстXML(Запись.ИдентификаторСообщения);
КонецПроцедуры

&НаКлиенте
Процедура РегистрацияИдентификаторТекстXML(Команда)
	СЭДОФССКлиент.ПоказатьТекстXML(Запись.РегистрацияИдентификатор);
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьОшибкиПоСтрокам()
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Регистрация.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	Регистрация.ТекстОшибкиСтроки КАК ТекстОшибкиСтроки,
	|	Регистрация.ИсходящийНомерСтроки КАК ИсходящийНомерСтроки,
	|	ТабличнаяЧасть.Заявление КАК Заявление,
	|	ТабличнаяЧасть.ОтветНаЗапрос КАК ОтветНаЗапрос,
	|	ТабличнаяЧасть.Ребенок КАК Ребенок
	|ИЗ
	|	РегистрСведений.РегистрацииУведомленийОПрекращенииОтпускаПоУходуЗаРебенком КАК Регистрация
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УведомлениеОПрекращенииОтпускаПоУходуЗаРебенком.ПрекращаемыеЗаявления КАК ТабличнаяЧасть
	|		ПО Регистрация.ИсходящийДокумент = ТабличнаяЧасть.Ссылка
	|			И Регистрация.ИсходящийНомерСтроки = ТабличнаяЧасть.НомерСтроки
	|ГДЕ
	|	Регистрация.ИдентификаторСообщения = &ИдентификаторСообщения
	|	И Регистрация.Страхователь = &Страхователь
	|	И Регистрация.ИдентификаторСтроки <> """"";
	Запрос.УстановитьПараметр("ИдентификаторСообщения", Запись.ИдентификаторСообщения);
	Запрос.УстановитьПараметр("Страхователь",           Запись.Страхователь);
	Таблица = Запрос.Выполнить().Выгрузить();
	ОшибкиПоСтрокам.Загрузить(Таблица);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораСтатусов()
	ПолеВвода = Элементы.РегистрацияСтатус;
	ТаблицаВыбора = РегистрыСведений.РегистрацииУведомленийОПрекращенииОтпускаПоУходуЗаРебенком.ВозможныеСтатусы();
	ТекущееЗначение = Запись.РегистрацияСтатус;
	ЗаполнитьСписокВыбораПоляВвода(ПолеВвода, ТаблицаВыбора, ТекущееЗначение);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьСписокВыбораПоляВвода(ПолеВвода, ТаблицаВыбора, ТекущееЗначение)
	СписокВыбора = ПолеВвода.СписокВыбора;
	СписокВыбора.Очистить();
	
	Для Каждого СтрокаТаблицы Из ТаблицаВыбора Цикл
		СписокВыбора.Добавить(СтрокаТаблицы.Статус, СтрокаТаблицы.Расшифровка);
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ТекущееЗначение)
		И СписокВыбора.НайтиПоЗначению(ТекущееЗначение) = Неопределено Тогда
		Текст = СтрШаблон(НСтр("ru = 'Недокументированное значение: ""%1"".'"), ТекущееЗначение);
		СписокВыбора.Добавить(ТекущееЗначение, Новый ФорматированнаяСтрока(Текст, , ЦветаСтиля.ПоясняющийОшибкуТекст));
		ПолеВвода.ЦветТекста          = ЦветаСтиля.ПоясняющийОшибкуТекст;
		ПолеВвода.ЦветТекстаЗаголовка = ЦветаСтиля.ПоясняющийОшибкуТекст;
	Иначе
		ПолеВвода.ЦветТекста          = Новый Цвет;
		ПолеВвода.ЦветТекстаЗаголовка = Новый Цвет;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьОбработчикОжиданияПрочитать()
	ОтключитьОбработчикОжидания("ОбработчикОжиданияПрочитать");
	ПодключитьОбработчикОжидания("ОбработчикОжиданияПрочитать", 0.2, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОжиданияПрочитать()
	Если Не Модифицированность Тогда
		Прочитать();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыФормы()
	Количество = ОшибкиПоСтрокам.Количество();
	Элементы.ДоставкаИдентификаторТекстXML.Видимость    = ЗначениеЗаполнено(Запись.ИдентификаторСообщения);
	Элементы.РегистрацияИдентификаторТекстXML.Видимость = ЗначениеЗаполнено(Запись.РегистрацияИдентификатор);
	Элементы.ОшибкиПоСтрокам.ВысотаВСтрокахТаблицы      = Количество;
	Элементы.ОшибкиПоСтрокам.Видимость                  = Количество > 0;
	Элементы.ОшибкиПоСтрокамРебенок.Видимость           = СЭДОФСС.ВидимостьПоляРодственник();
	
	Элементы.ОшибкиЛогическогоКонтроляГруппа.Видимость = Не ТолькоПросмотр
		Или Запись.ЕстьОшибкиФЛК;
	
	Если РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца Тогда
		Элементы.КоманднаяПанельПодвал.Видимость = Истина;
		КнопкаЗакрыть = Элементы.КнопкаЗакрытьВПодвале;
	Иначе
		Элементы.КоманднаяПанельПодвал.Видимость = Ложь;
		КнопкаЗакрыть = Элементы.КнопкаЗакрытьВШапке;
	КонецЕсли;
	
	Если Запись.ДоставкаУспех
		И Не ЗначениеЗаполнено(Запись.РегистрацияИдентификатор)
		И Не Запись.ЕстьОшибкиФЛК Тогда
		Элементы.ПолучитьНовыеСообщенияСЭДОФСС.КнопкаПоУмолчанию = Истина;
	Иначе
		КнопкаЗакрыть.КнопкаПоУмолчанию = Истина;
	КонецЕсли;
	
	КлючСохраненияПоложенияОкна = Формат(Количество, "ЧН=; ЧГ=")
		+ "/"
		+ Формат(Элементы.ОшибкиЛогическогоКонтроляГруппа.Видимость, "БЛ=0; БИ=1");
	
КонецПроцедуры

#КонецОбласти
